-- 1
select "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_СЕССИЯ"."УЧГОД"
from "Н_ЛЮДИ"
         right join "Н_СЕССИЯ" on "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
where "Н_ЛЮДИ"."ОТЧЕСТВО" = 'Александрович'
  AND "Н_СЕССИЯ"."ДАТА" = '2004-01-17';

-- 2
select Л."ИД", В."ЧЛВК_ИД", С."УЧГОД"
from "Н_ЛЮДИ" Л
         left join "Н_ВЕДОМОСТИ" В on Л."ИД" = В."ЧЛВК_ИД"
         left join "Н_СЕССИЯ" С on В."ЧЛВК_ИД" = С."ЧЛВК_ИД"
where Л."ФАМИЛИЯ" = 'Иванов'
  and В."ЧЛВК_ИД" > 153285
  and С."ИД" = 27640;

-- 3
select count(*)
from (select 1 from "Н_ЛЮДИ" group by "Н_ЛЮДИ"."ФАМИЛИЯ") as НЛ;

-- 4
select "Н_ЛЮДИ"."ФАМИЛИЯ", count("Н_ЛЮДИ"."ФАМИЛИЯ")
from "Н_ЛЮДИ"
where "Н_ЛЮДИ"."ФАМИЛИЯ" IN (select "Н_ЛЮДИ"."ФАМИЛИЯ"
                             FROM "Н_ЛЮДИ"
                                      JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
                                      JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
                                      JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
                                 AND ("Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'))
group by "Н_ЛЮДИ"."ФАМИЛИЯ"
having count("Н_ЛЮДИ"."ФАМИЛИЯ") < 50;

-- 5
select "Н_УЧЕНИКИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       avg(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as int))
from "Н_УЧЕНИКИ"
         join "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         join "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
where "Н_УЧЕНИКИ"."ГРУППА" = '4100'
  and "Н_ВЕДОМОСТИ"."ОЦЕНКА" SIMILAR TO '[0-9]*'
group by "Н_УЧЕНИКИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ",
         "Н_ЛЮДИ"."ИМЯ",
         "Н_ЛЮДИ"."ОТЧЕСТВО"
having avg(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as int)) = (select max(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as int))
                                                   from "Н_УЧЕНИКИ"
                                                            join "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                                                            join "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                                                   where "Н_УЧЕНИКИ"."ГРУППА" = '1101'
                                                     and "Н_ВЕДОМОСТИ"."ОЦЕНКА" SIMILAR TO '[0-9]*');

--6
select "Н_УЧЕНИКИ"."ГРУППА",
       "Н_УЧЕНИКИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       "Н_УЧЕНИКИ"."П_ПРКОК_ИД",
       "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ"
from "Н_УЧЕНИКИ"
         join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
         join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         join "Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
where "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная'
  and "Н_УЧЕНИКИ"."СОСТОЯНИЕ" = 'отчисл'
  and "Н_УЧЕНИКИ"."СОСТОЯНИЕ" = 'утвержден'
  and "Н_УЧЕНИКИ"."КОНЕЦ" = '2012-09-01';

-- 7
select "Н_УЧЕНИКИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       avg(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as int))
FROM "Н_ЛЮДИ"
         join "Н_УЧЕНИКИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
         join "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
    AND "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
where "Н_ВЕДОМОСТИ"."ОЦЕНКА" SIMILAR TO '[0-9]*'
group by "Н_УЧЕНИКИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ",
         "Н_ЛЮДИ"."ИМЯ",
         "Н_ЛЮДИ"."ОТЧЕСТВО"
having avg(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as int)) > 3.5;